app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "5"]]
---
  def show
    @beer = Beer.find(params[:id])